{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-03-12T10:02:31.5182057Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-03-13T10:58:35.8028621Z","name":"Win - PB - Applocker","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"97f9b303-275f-4301-8410-c4afbc91f8a3","templateReference":{"templateId":"4321b946-b76b-4450-8afd-769c08b16ffc_1","templateFamily":"endpointSecurityApplicationControl","templateDisplayName":"App Control for Business","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions","settingInstanceTemplateReference":{"settingInstanceTemplateId":"1de98212-6949-42dc-a89c-e0ff6e5da04b"},"choiceSettingValue":{"value":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_selected","settingValueTemplateReference":{"settingValueTemplateId":"b28c7dc4-c7b2-4ce2-8f51-6ebfd3ea69d3","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_applicationcontrol_built_in_controls_enable_app_control_1","children":[]}}]}]}]}}}]}