{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-03-07T13:35:46.0133446Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-03-07T23:35:05.0611867Z","name":"Win - PB - Defender Onboarding","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,microsoftSense","id":"c67b08f7-dd6e-4260-93c7-8c803641badb","templateReference":{"templateId":"0385b795-0f2f-44ac-8602-9f65bf6adede_1","templateFamily":"endpointSecurityEndpointDetectionAndResponse","templateDisplayName":"Endpoint detection and response","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_windowsadvancedthreatprotection_configurationtype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"23ab0ea3-1b12-429a-8ed0-7390cf699160"},"choiceSettingValue":{"value":"device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector","settingValueTemplateReference":{"settingValueTemplateId":"e5c7c98c-c854-4140-836e-bd22db59d651","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSecretSettingValue","settingValueTemplateReference":null,"value":"87995193-543f-4700-b519-f542d91d2ab0","valueState":"encryptedValueToken"}}]}}}]}