{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-03-07T23:40:32.2171887Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-03-07T23:40:32.2171887Z","name":"WIn - PB - EPM","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,endpointPrivilegeManagement","id":"4f94cc1b-ccb1-4b60-b87f-6bb94806703d","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_enableepm","settingInstanceTemplateReference":{"settingInstanceTemplateId":"58a79a4b-ba9b-4923-a7a5-6dc1a9f638a4"},"choiceSettingValue":{"value":"device_vendor_msft_policy_elevationclientsettings_enableepm_1","settingValueTemplateReference":{"settingValueTemplateId":"a13cc55c-307a-4962-aaec-20b832bf75c7","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_defaultelevationresponse","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_elevationclientsettings_defaultelevationresponse_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_privilegemanagement_elevationclientsettings_defaultelevationresponse_validation","settingInstanceTemplateReference":null,"choiceSettingCollectionValue":[{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_privilegemanagement_elevationclientsettings_defaultelevationresponse_validation_0","children":[]},{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_privilegemanagement_elevationclientsettings_defaultelevationresponse_validation_1","children":[]}]}]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_allowelevationdetection","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_elevationclientsettings_allowelevationdetection_0","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_senddata","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_elevationclientsettings_senddata_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_elevationclientsettings_reportingscope","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_elevationclientsettings_reportingscope_2","children":[]}}]}}]}}}]}